spec/vcr/SpreeEmerchantpayGenesis_GenesisProvider/emerchantpay_checkout_web_payment_form/when_purchase/with_stored_emerchantpay_payment.yml

---
http_interactions:
- request:
    method: post
    uri: https://staging.wpf.emerchantpay.net/wpf
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <wpf_payment>
          <transaction_id>sp-59a9c-7280-4558-a877-f7d31a52e</transaction_id>
          <amount>11000</amount>
          <currency>EUR</currency>
          <usage>Electronic transaction via Spree eCommerce platform</usage>
          <customer_email>natasha@oconner.ca</customer_email>
          <customer_phone>88888888888</customer_phone>
          <notification_url>http://127.0.0.1:4000/api/v2/storefront/emerchantpay_notification</notification_url>
          <return_success_url>http://localhost:4000/orders/R142094373</return_success_url>
          <return_failure_url>http://localhost:4000/checkout/payment?order_number=R142094373</return_failure_url>
          <return_cancel_url>http://localhost:4000/checkout/payment</return_cancel_url>
          <return_pending_url>http://localhost:4000/orders/R142094373</return_pending_url>
          <billing_address>
            <first_name>John</first_name>
            <last_name>Smith</last_name>
            <address1>2797 Sanford Harbors</address1>
            <zip_code>89171-1324</zip_code>
            <city>City</city>
            <state>Hawaii</state>
            <country>SX</country>
          </billing_address>
          <shipping_address>
            <first_name>John</first_name>
            <last_name>Smith</last_name>
            <address1>699 Maggio Underpass</address1>
            <zip_code>26090-1208</zip_code>
            <city>City</city>
            <state>Arizona</state>
            <country>GH</country>
          </shipping_address>
          <transaction_types>
            <transaction_type name="authorize3d"/>
            <transaction_type name="sale3d"/>
            <transaction_type name="wechat"/>
            <transaction_type name="post_finance"/>
            <transaction_type name="trustly_sale"/>
          </transaction_types>
          <threeds_v2_params>
            <control>
              <challenge_window_size>full_screen</challenge_window_size>
              <challenge_indicator>preference</challenge_indicator>
            </control>
            <purchase>
              <category>goods</category>
            </purchase>
            <merchant_risk>
              <shipping_indicator>stored_address</shipping_indicator>
              <delivery_timeframe>another_day</delivery_timeframe>
              <reorder_items_indicator>first_time</reorder_items_indicator>
            </merchant_risk>
            <card_holder_account>
              <creation_date>14-03-2024</creation_date>
              <update_indicator>current_transaction</update_indicator>
              <last_change_date>14-03-2024</last_change_date>
              <password_change_indicator>during_transaction</password_change_indicator>
              <password_change_date>14-03-2024</password_change_date>
              <shipping_address_usage_indicator>current_transaction</shipping_address_usage_indicator>
              <shipping_address_date_first_used>14-03-2024</shipping_address_date_first_used>
            </card_holder_account>
          </threeds_v2_params>
        </wpf_payment>
    headers:
      Content-Type:
      - text/xml
      Content-Length:
      - '2633'
      Authorization:
      - Basic example_credentials
      User-Agent:
      - 'Genesis Ruby Client 0.1.3. Network: GenesisRuby::Network::NetHttp'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/xml; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Date:
      - Thu, 14 Mar 2024 10:14:31 GMT
      Vary:
      - Accept
      Etag:
      - W/"db6d2a66935254a8f1573e4a14eca9a5"
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Request-Id:
      - 1997ad6a-3f3d-49a2-81d9-1ea1a39ad1e2
      X-Runtime:
      - '1.940736'
      Strict-Transport-Security:
      - max-age=631138519
      X-Frame-Options:
      - DENY
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      X-Download-Options:
      - noopen
      X-Permitted-Cross-Domain-Policies:
      - none
      Content-Security-Policy:
      - 'default-src https: ''self''; font-src ''self'' data:  https://fonts.gstatic.com;
        frame-src https: ''self''  staging.gate.emerchantpay.net:443; img-src ''self''
        data:  dadu5f16bpxo.cloudfront.net https://www.gstatic.com https://hatscripts.github.io;
        script-src https: ''self'' ''unsafe-inline''  js-agent.newrelic.com bam.nr-data.net
        pay.google.com; style-src https: ''self'' ''unsafe-inline''  dadu5f16bpxo.cloudfront.net;
        report-uri https://emerchantpay.report-uri.io/r/default/csp/enforce'
      X-Cache:
      - Miss from cloudfront
      Via:
      - 1.1 66a9923479828976fab7994dba229152.cloudfront.net (CloudFront)
      X-Amz-Cf-Pop:
      - DUB56-P2
      X-Amz-Cf-Id:
      - SisYfT9h57Ds7GmZIfDGPm8ieKFxCUHBgHgxYPrZi1l7MdSX3BHGww==
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <wpf_payment>
          <status>new</status>
          <unique_id>e6e89eace7821101679d68c13e312392</unique_id>
          <transaction_id>sp-59a9c-7280-4558-a877-f7d31a52e</transaction_id>
          <consumer_id>164343</consumer_id>
          <timestamp>2024-03-14T10:14:29Z</timestamp>
          <amount>11000</amount>
          <currency>EUR</currency>
          <redirect_url>https://staging.wpf.emerchantpay.net/en/v2/payment/e6e89eace7821101679d68c13e312392</redirect_url>
        </wpf_payment>
  recorded_at: Thu, 14 Mar 2024 10:14:31 GMT
recorded_with: VCR 6.2.0
