spec/vcr/SpreeEmerchantpayGenesis_GenesisProvider/emerchantpay_direct_processing/when_capture/with_stored_reference_payment.yml

---
http_interactions:
- request:
    method: post
    uri: https://staging.gate.emerchantpay.net/process/example_token/
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <payment_transaction>
          <transaction_type>capture</transaction_type>
          <transaction_id>sp-b02d2-a1ee-4cb7-a0ba-367c58668</transaction_id>
          <usage>Reference transaction via Spree eCommerce platform - Authorize3d</usage>
          <remote_ip>127.0.0.1</remote_ip>
          <reference_id>7e82b1d4eae5ab35c51fbaa68b23bcbd</reference_id>
          <amount>99</amount>
          <currency>EUR</currency>
        </payment_transaction>
    headers:
      Content-Type:
      - text/xml
      Content-Length:
      - '430'
      Authorization:
      - Basic example_credentials
      User-Agent:
      - 'Genesis Ruby Client 0.1.3. Network: GenesisRuby::Network::NetHttp'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/xml; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Date:
      - Tue, 06 Feb 2024 11:51:41 GMT
      Vary:
      - Accept
      Etag:
      - W/"1a5c9663dcd2c573dcfd2f761133f7d4"
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Request-Id:
      - 860e86c3-31b5-4772-bd97-67e57e08c510
      X-Runtime:
      - '0.879460'
      Strict-Transport-Security:
      - max-age=631138519
      X-Frame-Options:
      - ALLOWALL
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      X-Download-Options:
      - noopen
      X-Permitted-Cross-Domain-Policies:
      - none
      Content-Security-Policy:
      - 'default-src https: ''self''; font-src ''self'' data:; img-src https: ''self''
        data:; script-src https: ''self'' ''unsafe-inline'' js-agent.newrelic.com
        bam.nr-data.net; style-src https: ''self'' ''unsafe-inline''; report-uri https://emerchantpay.report-uri.io/r/default/csp/enforce'
      X-Cache:
      - Miss from cloudfront
      Via:
      - 1.1 eef8e8b0b7fc1b7ec6767325fac5e44c.cloudfront.net (CloudFront)
      X-Amz-Cf-Pop:
      - DUB56-P2
      X-Amz-Cf-Id:
      - o6w0gYi2y1vCyIdpCVF22iBctCMjknfibTIKdD0ukBUsyG7tbxjZvw==
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <payment_response>
          <transaction_type>capture</transaction_type>
          <status>approved</status>
          <unique_id>94f077b6046cf1195260b7324d0df4b7</unique_id>
          <transaction_id>sp-b02d2-a1ee-4cb7-a0ba-367c58668</transaction_id>
          <technical_message>TESTMODE: No real money will be transferred!</technical_message>
          <message>TESTMODE: No real money will be transferred!</message>
          <mode>test</mode>
          <timestamp>2024-02-06T11:51:40Z</timestamp>
          <descriptor>test</descriptor>
          <amount>99</amount>
          <currency>EUR</currency>
          <sent_to_acquirer>true</sent_to_acquirer>
        </payment_response>
  recorded_at: Tue, 06 Feb 2024 11:51:41 GMT
recorded_with: VCR 6.2.0
